var fs = require ("fs");
var XLSXChart = require ("./chart");
var xlsxChart = new XLSXChart ();
/*
var opts = {
	chart: "columnGroupAvg",
	chartTitle: "Привет",
	title: "Значение",
	groups: [{
		name: "Group1", length: 3
	}, {
		name: "Group2", length: 2
	}],
	fields: [
		"Field 1",
		"Field 2",
		"Field 3",
		"Field 4",
		"Field 5"
	],
	value: {
		"Field 1": 5,
		"Field 2": 10,
		"Field 3": 15,
		"Field 4": 20,
		"Field 5": 15
	},
	avg: 12,
	avgTitle: "Среднее",
	showVal: true,
	showValAvg: true
};
*/
var opts = {
	"chart": "columnGroupAvg",
	"chartTitle": "Рейтингование  образовательных организаций по показателю «Полнота и актуальность информации об организации» ",
	"title": "Значение",
	"groups": [
		{
			"name": "дошкольная образовательная организация",
			"length": 22
		},
		{
			"name": "общеобразовательная организация",
			"length": 13
		},
		{
			"name": "организация дополнительного образования",
			"length": 3
		}
	],
	"fields": [
		"МБДОУ детский сад № 10 «Ивушка»",
		"МБДОУ детский сад № 12 «Ручеек»",
		"МБДОУ детский сад № 13 «Радуга»",
		"ГКДОУ \"Детский сад N 3  \"Березка\"",
		"МБДОУ детский сад № 17 «Ромашка»",
		"МБДОУ детский сад № 26 «Орленок»",
		"МБДОУ детский сад № 27 «Ягодка»",
		"МБДОУ детский сад № 29 «Малышка»",
		"МБДОУ детский сад № 8 «Зоряночка»",
		"МБДОУ детский сад № 9 «Светлячок»",
		"МБДОУ ЦРР детский сад № 21 «Елочка»",
		"МБДОУ ЦРР детский сад № 4 «Золотой ключик»",
		"МБДОУ детский сад № 14 «Сказка»",
		"МБДОУ детский сад № 23 «Аленушка»",
		"МБДОУ детский сад № 28 «Колосок»",
		"МБДОУ детский сад № 2 «Красная шапочка»",
		"МБДОУ детский сад № 43 «Золотой петушок»",
		"МБДОУ детский сад № 6 «Чебурашка»",
		"МБДОУ ЦРР детский сад № 20 «Кристаллик»",
		"МБДОУ детский сад № 15 «Звездочка»",
		"МБДОУ детский сад № 16 «Ласточка»",
		"МБДОУ детский сад № 1 «Солнышко»",
		"МБОУ лицей № 6",
		"МБОУ гимназия «Интеллект»",
		"МБОУ СОШ № 1",
		"МБОУ СОШ № 12",
		"МБОУ СОШ № 2",
		"МБОУ СОШ № 9",
		"МБОУ СОШ № 10",
		"МБОУ СОШ № 4",
		"МБОУ СОШ № 5",
		"МБОУ Начальная школа – детский сад",
		"МБОУ СОШ № 8",
		"МБОУ СОШ № 3",
		"МБОУ СОШ № 7",
		"МБУ ДО «ЦРТДиЮ»",
		"МБУ ДО СЮТ",
		"МБУ ДО ДЮСШ «Вертикаль»"
	],
	"value": {
		"МБДОУ детский сад № 10 «Ивушка»": 9,
		"МБДОУ детский сад № 12 «Ручеек»": 9,
		"МБДОУ детский сад № 13 «Радуга»": 9,
		"ГКДОУ \"Детский сад N 3  \"Березка\"": 8,
		"МБДОУ детский сад № 17 «Ромашка»": 8,
		"МБДОУ детский сад № 26 «Орленок»": 8,
		"МБДОУ детский сад № 27 «Ягодка»": 8,
		"МБДОУ детский сад № 29 «Малышка»": 8,
		"МБДОУ детский сад № 8 «Зоряночка»": 8,
		"МБДОУ детский сад № 9 «Светлячок»": 8,
		"МБДОУ ЦРР детский сад № 21 «Елочка»": 8,
		"МБДОУ ЦРР детский сад № 4 «Золотой ключик»": 8,
		"МБДОУ детский сад № 14 «Сказка»": 7,
		"МБДОУ детский сад № 23 «Аленушка»": 7,
		"МБДОУ детский сад № 28 «Колосок»": 7,
		"МБДОУ детский сад № 2 «Красная шапочка»": 7,
		"МБДОУ детский сад № 43 «Золотой петушок»": 7,
		"МБДОУ детский сад № 6 «Чебурашка»": 7,
		"МБДОУ ЦРР детский сад № 20 «Кристаллик»": 7,
		"МБДОУ детский сад № 15 «Звездочка»": 6,
		"МБДОУ детский сад № 16 «Ласточка»": 6,
		"МБДОУ детский сад № 1 «Солнышко»": 6,
		"МБОУ лицей № 6": 10,
		"МБОУ гимназия «Интеллект»": 9,
		"МБОУ СОШ № 1": 9,
		"МБОУ СОШ № 12": 9,
		"МБОУ СОШ № 2": 9,
		"МБОУ СОШ № 9": 9,
		"МБОУ СОШ № 10": 8,
		"МБОУ СОШ № 4": 8,
		"МБОУ СОШ № 5": 8,
		"МБОУ Начальная школа – детский сад": 7,
		"МБОУ СОШ № 8": 7,
		"МБОУ СОШ № 3": 6,
		"МБОУ СОШ № 7": 6,
		"МБУ ДО «ЦРТДиЮ»": 10,
		"МБУ ДО СЮТ": 9,
		"МБУ ДО ДЮСШ «Вертикаль»": 7
	},
	"avg": "7.82",
	"avgTitle": "Среднее",
	"showVal": true,
	"showValAvg": true
};
xlsxChart.generate (opts, function (err, data) {
	console.log (err);
	fs.writeFileSync ("chart.xlsx", data);
});
